money=input("돈 입력")
str1=len(money)
if str1>=5:
 print("5만원권 개수 : ",money//50000)
 print("1만원권 개수 : ",(money%50000)//10000)
 print("5천원권 개수 : ",((money%50000)%10000)//5000)
 print("1천원권 개수 : ",(((money%50000)%10000)%5000)//1000)
 print("5백원권 개수 : ",((((money%50000)%10000)%5000)%1000)//500)
 print("1백원권 개수 : ",(((((money%50000)%10000)%5000)%1000)%500)//100)
 print("5십원권 개수 : ",((((((money%50000)%10000)%5000)%1000)%500)%100)//50)
 print("1십원권 개수 : ",(((((((money%50000)%10000)%5000)%1000)%500)%100)%50)//10)
elif str>=4:
  print("5천원권 개수 : ",((money%50000)%10000)//5000)
  print("1천원권 개수 : ",(((money%50000)%10000)%5000)//1000)
  print("5백원권 개수 : ",((((money%50000)%10000)%5000)%1000)//500)
  print("1백원권 개수 : ",(((((money%50000)%10000)%5000)%1000)%500)//100)
  print("5십원권 개수 : ",((((((money%50000)%10000)%5000)%1000)%500)%100)//50)
  print("1십원권 개수 : ",(((((((money%50000)%10000)%5000)%1000)%500)%100)%50)//10)
elif str>=3:
  print("5백원권 개수 : ",((((money%50000)%10000)%5000)%1000)//500)
  print("1백원권 개수 : ",(((((money%50000)%10000)%5000)%1000)%500)//100)
  print("5십원권 개수 : ",((((((money%50000)%10000)%5000)%1000)%500)%100)//50)
  print("1십원권 개수 : ",(((((((money%50000)%10000)%5000)%1000)%500)%100)%50)//10)
elif str>2:
  print("5십원권 개수 : ",((((((money%50000)%10000)%5000)%1000)%500)%100)//50)
  print("1십원권 개수 : ",(((((((money%50000)%10000)%5000)%1000)%500)%100)%50)//10)
else:
  print("돈이 모자라요")

 

# str1 = input("문자를 입력하시오")
# a=len(str1) # 문자의 길이 .length
# if a==5:
#   print("a는5")
# elif a==4:  #else if
#   print("a는4")
# else:
#   print("a는 3이하입니다")


# print("5만원권 개수 : ",money//50000)
# print("1만원권 개수 : ",(money%50000)//10000)
# print("5천원권 개수 : ",((money%50000)%10000)//5000)
# print("1천원권 개수 : ",(((money%50000)%10000)%5000)//1000)
# print("5백원권 개수 : ",((((money%50000)%10000)%5000)%1000)//500)
# print("1백원권 개수 : ",(((((money%50000)%10000)%5000)%1000)%500)//100)
# print("5십원권 개수 : ",((((((money%50000)%10000)%5000)%1000)%500)%100)//50)
# print("1십원권 개수 : ",(((((((money%50000)%10000)%5000)%1000)%500)%100)%50)//10)